In [39]:
import psycopg2
import pandas as pd
import numpy as np

In [40]:
from sqlalchemy import create_engine
from sqlalchemy import inspect, func
from sqlalchemy.ext.automap import automap_base
from sqlalchemy.orm import Session
engine = create_engine('postgresql://postgres:postgres@localhost:5432/SQLChallenge')
connection = engine.connect()

In [41]:
connection

In [42]:
inspector=inspect(engine)
inspector.get_table_names()

['Department', 'Titles', 'Employees', 'Salaries', 'Dept_Emp', 'Dept_manager']

In [55]:
# Using the inspector to print the column names within the 'dow' table and its types
columns = inspector.get_columns('Department')
for column in columns:
    print(column["name"], column["type"])

dept_no VARCHAR
dept_name VARCHAR

In [56]:
Base = automap_base()
Base.prepare(engine, reflect=True)

In [103]:
#Print the classes mapped to the base
Base.classes.keys()

['Department', 'Titles', 'Employees', 'Dept_Emp', 'Dept_manager', 'Salaries']

In [104]:
# Assign the classes to seperate variables
Salary=Base.classes.Salaries
Employee = Base.classes.Employees
Department = Base.classes.Department
Title=Base.classes.Titles

In [ ]:
# Create session
session = Session(engine)

In [94]:

emp_data= session.query(Employee.emp_no, Employee.first_name, Employee.last_name, Employee.emp_title).\
    order_by(Employee.emp_no.desc()).all()
#dept_data=session.query(Department.dept_no, Department.dept_name).order_by(Department.dept_no.desc()).all()
title_data=session.query(Title.title_id, Title.title).all()
salary_data=session.query(Salary.emp_no, Salary.salary)

In [102]:
#Create an Employee dataframe
employee_df=pd.DataFrame(emp_data, columns=['emp_no', 'first_name', 'last_name','emp_title'])

   emp_no first_name last_name emp_title
0  499999     Sachin   Tsukuda     e0002
1  499998   Patricia   Breugel     s0001
2  499997    Berhard    Lenart     e0003
3  499996       Zito      Baaz     e0003
4  499995     Dekang  Lichtner     e0002

In [92]:
#Create a Title dataframe
title_df=pd.DataFrame(title_data, columns=['title_id', 'title'])

  title_id               title
0    s0001               Staff
1    s0002        Senior Staff
2    e0001  Assistant Engineer
3    e0002            Engineer
4    e0003     Senior Engineer

In [93]:
merged_df=pd.merge(employee_df,title_df, left_on='emp_title', right_on='title_id', how='left')
del merged_df['title_id']

In [89]:
merged_df.head(10)

   emp_no first_name     last_name emp_title            title
0  499999     Sachin       Tsukuda     e0002         Engineer
1  499998   Patricia       Breugel     s0001            Staff
2  499997    Berhard        Lenart     e0003  Senior Engineer
3  499996       Zito          Baaz     e0003  Senior Engineer
4  499995     Dekang      Lichtner     e0002         Engineer
5  499994      Navin       Argence     e0002         Engineer
6  499993   DeForest  Mullainathan     e0002         Engineer
7  499992     Siamak      Salverda     s0001            Staff
8  499991      Pohua       Sichman     s0001            Staff
9  499990     Khaled       Kohling     e0002         Engineer

In [98]:
salary_data=session.query(Salary.emp_no, Salary.salary)
salary_df=pd.DataFrame(salary_data, columns=['emp_no', 'salary'])
salary_df.head()

   emp_no      salary
0   10001  $60,117.00
1   10002  $65,828.00
2   10003  $40,006.00
3   10004  $40,054.00
4   10005  $78,228.00

In [99]:
combined_df=pd.merge(merged_df,salary_df, on='emp_no', how='left')

In [101]:
print(len(combined_df))
combined_df.head(10)

300024